Repository: JumpLink/Learn6502
Catalog: packages/translations/*.po
Languages: de

source: Unable to relocate code outside 64k memory
de: Code kann nicht außerhalb des 64k Speicherbereichs verschoben werden

source: Assembling code ...
de: Code wird assembliert...

source: No code to run.
de: Kein Code zum Ausführen vorhanden.

source: Syntax error line %d: %s
de: Syntaxfehler in Zeile %d: %s

source: Out of range branch on line %d (branches are limited to -128 to +127): %s
de: Sprungbefehl außerhalb des gültigen Bereichs in Zeile %d (Sprünge sind auf -128 bis +127 begrenzt): %s

source: Code assembled successfully, %d bytes.
de: Code erfolgreich assembliert, %d Bytes.

source: Preprocessing ...
de: Vorverarbeitung läuft...

source: Found $d labels.
de: %d Labels gefunden.

source: Found $d label.
de: %d Label gefunden.

source: Indexing labels...
de: Labels werden indiziert...

source: Label already defined at line %s: %d
de: Label wurde bereits in Zeile %d definiert: %s

source: Label {label} is already used as a symbol; please rename one of them
de: Label {label} wird bereits als Symbol verwendet; bitte eines davon umbenennen

source: No address or label provided
de: Keine Adresse oder Label angegeben

source: Unable to find/parse given address/label
de: Die angegebene Adresse/Label konnte nicht gefunden oder verarbeitet werden

source: Stopped
de: Angehalten

source: wdm-output
de: WDM-Ausgabe

source: Address %s - unknown opcode
de: Adresse %s - unbekannter Opcode

source: 6502 Stack filled! Wrapping...
de: 6502 Stack voll! Überlauf...

source: 6502 Stack emptied! Wrapping...
de: 6502 Stack leer! Unterlauf...

source: Program completed at PC=$%s
de: Programm beendet bei PC=$%s

source: Unsaved changes
de: Uneingespeicherte Änderungen

source: File "%s" has unsaved changes
de: Datei "%s" enthält ungespeicherte Änderungen

source: Assemble
de: Assemblieren

source: Run
de: Ausführen

source: Resume
de: Fortsetzen

source: Reset
de: Zurücksetzen

source: Step
de: Schritt

source: Code copied to editor
de: Code in Editor kopiert

source: Copied to clipboard
de: In die Zwischenablage kopiert

source: Failed to copy to clipboard
de: Konnte nicht in die Zwischenablage kopiert werden

source: Program paused automatically
de: Programm automatisch pausiert

source: Assembled successfully
de: Erfolgreich assembliert

source: Assemble failed
de: Assemblierung fehlgeschlagen

source: Disassembly:
de: Disassemblierung:

source: Simulator failure
de: Simulator-Fehler

source: Labels failure
de: Label-Fehler

source: Gamepad key pressed:
de: Gamepad-Taste gedrückt:

source: Open Assembly File
de: Assembler-Datei öffnen

source: Failed to load file
de: Datei konnte nicht geladen werden

source: File loaded successfully
de: Datei erfolgreich geladen

source: Error opening file
de: Fehler beim Öffnen der Datei

source: untitled
de: unbenannt

source: Save Assembly File
de: Assembler Datei speichern

source: Error saving file
de: Fehler beim Speichern der Datei

source: File saved successfully
de: Datei erfolgreich gespeichert

source: Assembly Files
de: Assembler-Dateien

source: All Files
de: Alle Dateien

source: Learn 6502 Assembly
de: Lerne 6502 Assembler

source: Menu
de: Menü

source: Learn
de: Lernen

source: Game Console
de: Spielkonsole

source: Open...
de: Öffnen...

source: Save
de: Speichern

source: Save as...
de: Speichern unter...

source: Help
de: Hilfe

source: About Learn 6502 Assembly
de: Über Lerne 6502 Assembler

source: Quit
de: Beenden

source: Continue
de: Fortfahren

source: Save changes?
de: Änderungen speichern?

source: Your file has unsaved changes. Changes will be lost if you don't save them.
de: Deine Datei enthält ungespeicherte Änderungen. Die Änderungen gehen verloren, wenn du sie nicht speicherst.

source: Cancel
de: Abbrechen

source: Discard
de: Verwerfen

source: Learn how to program the 6502 microprocessor.
de: Lerne, wie man den 6502-Mikroprozessor programmiert.

source: Preferences
de: Einstellungen

source: Appearance
de: Erscheinungsbild

source: Main Settings
de: Haupteinstellungen

source: There are currently no settings.
de: Derzeit gibt es keine Einstellungen.

source: Copy to editor
de: In Editor kopieren

source: Debug your 6502 assembly code, step through your program, and view memory and registers. To get started, assemble and run your program.
de: Debugge deinen 6502-Assemblercode, gehe dein Programm schrittweise durch und betrachte Speicher und Register. Kompiliere und starte dein Programm, um zu beginnen.

source: Messages
de: Meldungen

source: Disassembled
de: Disassemblierter Code

source: Zero Page ($0000-$00FF)
de: Nullseite ($0000-$00FF)

source: Display Memory ($0200-$05FF)
de: Anzeigespeicher ($0200-$05FF)

source: Program Storage ($0600-$FFFF)
de: Programmspeicher ($0600-$FFFF)

source: Snake Game Data ($00-$15)
de: Snake-Spieldaten ($00-$15)

source: Random/Input ($FE-$FF)
de: Zufalls-/Eingabedaten ($FE-$FF)

source: Full Memory ($0000-$FFFF)
de: Gesamter Speicher ($0000-$FFFF)

source: Copy to clipboard
de: In die Zwischenablage kopieren

source: 6502 Assembly Learning Environment
de: Lernumgebung für 6502-Assembler

source: A comprehensive learning environment for programming vintage computers and game consoles using 6502 assembly language.
de: Eine umfassende Lernumgebung für die Programmierung von Retro-Computern und Spielkonsolen mit 6502-Assembler.

source: Features:
de: Funktionen:

source: Learn step-by-step with an interactive tutorial
de: Lerne Schritt für Schritt mit einem interaktiven Tutorial

source: Write code with a built-in editor
de: Schreibe Code mit einem integrierten Editor

source: Debug your programs with real-time tools
de: Debugge deine Programme mit Echtzeit-Tools

source: See your code run on a virtual game console
de: Führe deinen Code auf einer virtuellen Spielkonsole aus

source: Interactive tutorial interface in light theme
de: Interaktive Tutorial-Oberfläche im hellen Design

source: Interactive tutorial interface in dark theme
de: Interaktive Tutorial-Oberfläche im dunklen Design

source: Code editor with 6502 assembly syntax highlighting and visible help
de: Code-Editor mit Syntaxhervorhebung für 6502-Assembler und sichtbarer Hilfe

source: Built-in debugger showing real-time registers, flags, and memory
de: Integrierter Debugger mit Echtzeit-Anzeige von Registern, Flags und Speicher

source: Virtual game console displaying three colored pixels
de: Virtuelle Spielkonsole mit drei farbigen Pixeln

source: Major update focusing on improved learning experience and usability
de: Umfangreiches Update mit Fokus auf verbessertes Lernerlebnis und Benutzerfreundlichkeit

source: Added help feature to make code editing easier for beginners
de: Hilfefunktion hinzugefügt, um die Codebearbeitung für Anfänger zu erleichtern

source: Improved game screen and controls for mobile devices
de: Verbesserte Spieloberfläche und Steuerung für mobile Geräte

source: New tools to examine your code, including disassembler and fast switchable memory viewer
de: Neue Werkzeuge zur Code-Analyse, einschließlich Disassembler und schnell umschaltbarer Speicheransicht

source: Many minor bugs have been fixed to improve overall usability
de: Zahlreiche kleine Fehler wurden behoben, um die allgemeine Benutzerfreundlichkeit zu verbessern

source: Games now automatically pause when switching between screens
de: Spiele werden jetzt automatisch pausiert, wenn zwischen Bildschirmen gewechselt wird

source: Added file management to save and load your programs
de: Dateiverwaltung zum Speichern und Laden von Programmen hinzugefügt

source: Enhanced app presentation and accessibility
de: Verbesserte App-Darstellung und Zugänglichkeit

source: Improved descriptions to be more welcoming for non-technical users
de: Verbesserte Beschreibungen für nicht-technische Benutzer

source: Optimized Flatpak configuration by removing unnecessary permissions
de: Optimierte Flatpak-Konfiguration durch Entfernen unnötiger Berechtigungen

source: Improved the game console performance for smoother gameplay
de: Verbesserte Leistung der Spielekonsole für flüssigeres Gameplay

source: Enhanced the hex monitor address range input for easier value editing
de: Verbesserte Eingabe des Adressbereichs im Hex-Monitor

source: Reduced default hex monitor address range for better efficiency
de: Reduzierter Standard-Adressbereich des Hex-Monitors für bessere Effizienz

source: Debugger now only updates when visible, reducing unnecessary processing
de: Debugger wird nur noch aktualisiert, wenn er sichtbar ist, reduziert unnötige Verarbeitung

source: Fixed build error on PostmarketOS, improving mobile compatibility
de: Build-Fehler unter PostmarketOS behoben, verbessert Kompatibilität mit Mobilgeräten

source: First release of Learn 6502 Assembly for GNOME
de: Erste Veröffentlichung von Lerne 6502 Assembler für GNOME

source: Assembly
de: Assembler

source: Programming
de: Programmierung

source: Learning
de: Lernen

source: Memory Map
de: Speicherbelegung

source: <b>Zero Page</b>: <tt>$0000</tt>-<tt>$00FF</tt> (first 256 bytes, faster access)
de: <b>Zero Page</b>: <tt>$0000</tt>-<tt>$00FF</tt> (erste 256 Bytes, schnellerer Zugriff)

source: <b>Display Memory</b>: <tt>$0200</tt>-<tt>$05FF</tt> (used for screen output)
de: <b>Anzeigespeicher</b>: <tt>$0200</tt>-<tt>$05FF</tt> (für Bildschirmausgabe)

source: <b>Program Storage</b>: Starting at <tt>$0600</tt>
de: <b>Programmspeicher</b>: Beginnt bei <tt>$0600</tt>

source: Display Organization
de: Bildschirmorganisation

source: Screen maps to memory range <tt>$0200</tt>-<tt>$05FF</tt>
de: Bildschirm wird auf Speicherbereich <tt>$0200</tt>-<tt>$05FF</tt> abgebildet

source: Values <tt>$00</tt>-<tt>$0F</tt> represent 16 different colors (<tt>$00</tt>=black, <tt>$01</tt>=white)
de: Werte <tt>$00</tt>-<tt>$0F</tt> stellen 16 verschiedene Farben dar (<tt>$00</tt>=schwarz, <tt>$01</tt>=weiß)

source: Organized as four horizontal strips of 32×8 pixels
de: Organisiert als vier horizontale Streifen von 32×8 Pixeln

source: First row: <tt>$0200</tt>-<tt>$021F</tt>, second row: <tt>$0220</tt>-<tt>$023F</tt>, etc.
de: Erste Zeile: <tt>$0200</tt>-<tt>$021F</tt>, zweite Zeile: <tt>$0220</tt>-<tt>$023F</tt>, usw.

source: Color Palette
de: Farbpalette

source: <b><tt>$0</tt></b>: Black (<tt>#000000</tt>)
de: <b><tt>$0</tt></b>: Schwarz (<tt>#000000</tt>)

source: <b><tt>$1</tt></b>: White (<tt>#ffffff</tt>)
de: <b><tt>$1</tt></b>: Weiß (<tt>#ffffff</tt>)

source: <b><tt>$2</tt></b>: Red (<tt>#880000</tt>)
de: <b><tt>$2</tt></b>: Rot (<tt>#880000</tt>)

source: <b><tt>$4</tt></b>: Purple (<tt>#cc44cc</tt>)
de: <b><tt>$4</tt></b>: Lila (<tt>#cc44cc</tt>)

source: <b><tt>$5</tt></b>: Green (<tt>#00cc55</tt>)
de: <b><tt>$5</tt></b>: Grün (<tt>#00cc55</tt>)

source: <b><tt>$6</tt></b>: Blue (<tt>#0000aa</tt>)
de: <b><tt>$6</tt></b>: Blau (<tt>#0000aa</tt>)

source: <b><tt>$7</tt></b>: Yellow (<tt>#eeee77</tt>)
de: <b><tt>$7</tt></b>: Gelb (<tt>#eeee77</tt>)

source: <b><tt>$9</tt></b>: Brown (<tt>#664400</tt>)
de: <b><tt>$9</tt></b>: Braun (<tt>#664400</tt>)

source: <b><tt>$a</tt></b>: Light red (<tt>#ff7777</tt>)
de: <b><tt>$a</tt></b>: Hellrot (<tt>#ff7777</tt>)

source: <b><tt>$b</tt></b>: Dark grey (<tt>#333333</tt>)
de: <b><tt>$b</tt></b>: Dunkelgrau (<tt>#333333</tt>)

source: <b><tt>$c</tt></b>: Grey (<tt>#777777</tt>)
de: <b><tt>$c</tt></b>: Grau (<tt>#777777</tt>)

source: <b><tt>$d</tt></b>: Light green (<tt>#aaff66</tt>)
de: <b><tt>$d</tt></b>: Hellgrün (<tt>#aaff66</tt>)

source: <b><tt>$e</tt></b>: Light blue (<tt>#0088ff</tt>)
de: <b><tt>$e</tt></b>: Hellblau (<tt>#0088ff</tt>)

source: <b><tt>$f</tt></b>: Light grey (<tt>#bbbbbb</tt>)
de: <b><tt>$f</tt></b>: Hellgrau (<tt>#bbbbbb</tt>)

source: Registers
de: Register

source: <b>A</b> (Accumulator): Main register for calculations and data manipulation
de: <b>A</b> (Akkumulator): Hauptregister für Berechnungen und Datenmanipulation

source: <b>X, Y</b>: Index registers for addressing and counting
de: <b>X, Y</b>: Indexregister für Adressierung und Zählung

source: <b>SP</b> (Stack Pointer): Points to current stack position (starts at <tt>$FF</tt>)
de: <b>SP</b> (Stack Pointer): Zeigt auf aktuelle Stack-Position (beginnt bei <tt>$FF</tt>)

source: <b>PC</b> (Program Counter): Points to the next instruction to execute
de: <b>PC</b> (Program Counter): Zeigt auf die nächste auszuführende Anweisung

source: Processor Flags
de: Prozessor-Flags

source: <b>N</b> (Negative): Set when bit 7 of result is set
de: <b>N</b> (Negativ): Gesetzt, wenn Bit 7 des Ergebnisses gesetzt ist

source: <b>V</b> (Overflow): Set when arithmetic operation causes signed overflow
de: <b>V</b> (Überlauf): Gesetzt, wenn arithmetische Operation einen Vorzeichenüberlauf verursacht

source: <b>B</b> (Break): Set when BRK instruction is executed
de: <b>B</b> (Break): Gesetzt, wenn BRK-Anweisung ausgeführt wird

source: <b>D</b> (Decimal): Set when processor is in BCD (Binary Coded Decimal) mode
de: <b>D</b> (Dezimal): Gesetzt, wenn Prozessor im BCD-Modus (Binary Coded Decimal) ist

source: <b>I</b> (Interrupt): Set when interrupts are disabled
de: <b>I</b> (Interrupt): Gesetzt, wenn Interrupts deaktiviert sind

source: <b>Z</b> (Zero): Set when result is zero
de: <b>Z</b> (Null): Gesetzt, wenn Ergebnis null ist

source: <b>C</b> (Carry): Set when arithmetic operations overflow a byte
de: <b>C</b> (Übertrag): Gesetzt, wenn arithmetische Operationen ein Byte überlaufen

source: Used for conditional branching
de: Wird für bedingte Verzweigungen verwendet

source: Addressing Modes
de: Adressierungsmodi

source: <b>Immediate</b> (<tt>#$c0</tt>): Use the actual value
de: <b>Unmittelbar</b> (<tt>#$c0</tt>): Verwendet den tatsächlichen Wert

source: <b>Zero Page</b> (<tt>$c0</tt>): Access memory locations <tt>$00</tt>-<tt>$FF</tt>
de: <b>Nullseite</b> (<tt>$c0</tt>): Greift auf Speicheradressen <tt>$00</tt>-<tt>$FF</tt> zu

source: <b>Absolute</b> (<tt>$c000</tt>): Access any memory location
de: <b>Absolut</b> (<tt>$c000</tt>): Greift auf beliebige Speicheradressen zu

source: <b>Zero Page,X/Y</b> (<tt>$c0,X</tt>): Add X/Y register to zero page address
de: <b>Nullseite,X/Y</b> (<tt>$c0,X</tt>): Addiert X/Y-Register zur Nullseitenadresse

source: <b>Absolute,X/Y</b> (<tt>$c000,X</tt>): Add X/Y register to absolute address
de: <b>Absolut,X/Y</b> (<tt>$c000,X</tt>): Addiert X/Y-Register zur absoluten Adresse

source: <b>Indirect</b> (<tt>($c000)</tt>): Look up address stored at given location
de: <b>Indirekt</b> (<tt>($c000)</tt>): Liest die an der angegebenen Adresse gespeicherte Adresse

source: <b>Indexed Indirect</b> (<tt>($c0,X)</tt>): Add X to zero page address, then dereference
de: <b>Indiziert Indirekt</b> (<tt>($c0,X)</tt>): Addiert X zur Nullseitenadresse, dann dereferenzieren

source: <b>Indirect Indexed</b> (<tt>($c0),Y</tt>): Dereference zero page address, then add Y
de: <b>Indirekt Indiziert</b> (<tt>($c0),Y</tt>): Dereferenziert Nullseitenadresse, dann Y addieren

source: Common Instructions
de: Häufige Anweisungen

source: <b>LDA/LDX/LDY</b>: Load registers
de: <b>LDA/LDX/LDY</b>: Register laden

source: <b>STA/STX/STY</b>: Store registers to memory
de: <b>STA/STX/STY</b>: Register im Speicher ablegen

source: <b>INX/INY/DEX/DEY</b>: Increment/decrement registers
de: <b>INX/INY/DEX/DEY</b>: Register erhöhen/verringern

source: <b>ADC/SBC</b>: Add/subtract with carry
de: <b>ADC/SBC</b>: Addieren/Subtrahieren mit Übertrag

source: <b>JMP</b>: Unconditional jump
de: <b>JMP</b>: Unbedingter Sprung

source: <b>JSR/RTS</b>: Jump to subroutine / Return from subroutine
de: <b>JSR/RTS</b>: Sprung zu Unterprogramm / Rückkehr aus Unterprogramm

source: <b>BEQ/BNE/BCC/BCS</b>: Branch if equal/not equal/carry clear/carry set
de: <b>BEQ/BNE/BCC/BCS</b>: Verzweige wenn gleich/ungleich/Übertrag gelöscht/Übertrag gesetzt

source: <b>PHA/PLA</b>: Push/pull accumulator to/from stack
de: <b>PHA/PLA</b>: Akkumulator auf Stack legen/vom Stack holen

source: Special Memory Locations (in Simulator)
de: Spezielle Speicheradressen (im Simulator)

source: <b><tt>$FE</tt></b>: Random number generator (reads as a random value 0-255)
de: <b><tt>$FE</tt></b>: Zufallszahlengenerator (liefert einen Zufallswert 0-255)

source: <b><tt>$FF</tt></b>: Last pressed key (ASCII code)
de: <b><tt>$FF</tt></b>: Zuletzt gedrückte Taste (ASCII-Code)

source: <b>Directional controls</b>:
de: <b>Richtungssteuerung</b>:

source: <b>W</b> or Up Arrow key (<tt>$77</tt>)
de: <b>W</b> oder Pfeil nach oben (<tt>$77</tt>)

source: <b>A</b> or Left Arrow key (<tt>$61</tt>)
de: <b>A</b> oder Pfeil nach links (<tt>$61</tt>)

source: <b>S</b> or Down Arrow key (<tt>$73</tt>)
de: <b>S</b> oder Pfeil nach unten (<tt>$73</tt>)

source: <b>D</b> or Right Arrow key (<tt>$64</tt>)
de: <b>D</b> oder Pfeil nach rechts (<tt>$64</tt>)

source: <b>Action buttons</b>:
de: <b>Aktionstasten</b>:

source: <b>Q</b> or Enter/Return key (<tt>$0D</tt>)
de: <b>Q</b> oder Eingabe/Return-Taste (<tt>$0D</tt>)

source: <b>E</b> or Space key (<tt>$20</tt>)
de: <b>E</b> oder Leertaste (<tt>$20</tt>)

source: Snake Game Memory Usage
de: Speichernutzung im Snake-Spiel

source: <b><tt>$00</tt>-<tt>$01</tt></b>: Apple position
de: <b><tt>$00</tt>-<tt>$01</tt></b>: Apfel-Position

source: <b><tt>$02</tt></b>: Snake direction (1=up, 2=right, 4=down, 8=left)
de: <b><tt>$02</tt></b>: Schlangen-Richtung (1=oben, 2=rechts, 4=unten, 8=links)

source: <b><tt>$03</tt></b>: Snake length
de: <b><tt>$03</tt></b>: Schlangen-Länge

source: <b><tt>$10</tt>-<tt>$15</tt></b>: Snake position data (head, body segments, tail)
de: <b><tt>$10</tt>-<tt>$15</tt></b>: Schlangen-Positionsdaten (Kopf, Körpersegmente, Schwanz)

source: Tutorial <sub>by <a href="https://www.skilldrick.co.uk/">Nick Morgan</a>, licensed under CC BY 4.0</sub>
de: Tutorial <sub>von <a href="https://www.skilldrick.co.uk/">Nick Morgan</a>, lizenziert unter CC BY 4.0</sub>

source: Introduction
de: Einführung

source: In this tiny tutorial I'm going to show you how to get started writing 6502 assembly language. The 6502 processor was massive in the seventies and eighties, powering famous computers like the <a href="http://en.wikipedia.org/wiki/BBC_Micro">BBC Micro</a>, <a href="http://en.wikipedia.org/wiki/Atari_2600">Atari 2600</a>, <a href="http://en.wikipedia.org/wiki/Commodore_64">Commodore 64</a>, <a href="http://en.wikipedia.org/wiki/Apple_II">Apple II</a>, and the <a href="http://en.wikipedia.org/wiki/Nintendo_Entertainment_System">Nintendo Entertainment System</a>. Bender in Futurama <a href="http://www.transbyte.org/SID/SID-files/Bender_6502.jpg">has a 6502 processor for a brain</a>. <a href="http://www.pagetable.com/docs/terminator/00-37-23.jpg">Even the Terminator was programmed in 6502</a>.
de: In diesem kleinen Tutorial zeige ich dir, wie du mit der 6502-Assemblersprache loslegen kannst. Der 6502-Prozessor war in den Siebzigern und Achtzigern riesig und trieb berühmte Computer wie den <a href="http://en.wikipedia.org/wiki/BBC_Micro">BBC Micro</a>, <a href="http://en.wikipedia.org/wiki/Atari_2600">Atari 2600</a>, <a href="http://en.wikipedia.org/wiki/Commodore_64">Commodore 64</a>, <a href="http://en.wikipedia.org/wiki/Apple_II">Apple II</a> und das <a href="http://en.wikipedia.org/wiki/Nintendo_Entertainment_System">Nintendo Entertainment System</a> an. Bender aus Futurama <a href="http://www.transbyte.org/SID/SID-files/Bender_6502.jpg">hat einen 6502-Prozessor als Gehirn</a>. <a href="http://www.pagetable.com/docs/terminator/00-37-23.jpg">Sogar der Terminator wurde in 6502 programmiert</a>.

source: So, why would you want to learn 6502? It's a dead language isn't it? Well, so's Latin. And they still teach that. <a href="http://en.wikipedia.org/wiki/Q.E.D.">Q.E.D.</a>
de: Warum solltest du also 6502 lernen wollen? Es ist doch eine tote Sprache, oder? Nun, Latein ist das auch. Und das wird immer noch unterrichtet. <a href="http://en.wikipedia.org/wiki/Q.E.D.">Q.E.D.</a>

source: (Actually, I've been reliably informed that 6502 processors are still being produced by <a href="http://www.westerndesigncenter.com/wdc/w65c02s-chip.cfm">Western Design Center</a> and <a href="http://www.mouser.co.uk/Search/Refine.aspx?Keyword=65C02">sold to hobbyists</a>, so clearly 6502 isn't a dead language! Who knew?)
de: (Tatsächlich wurde mir zuverlässig mitgeteilt, dass 6502-Prozessoren immer noch von <a href="http://www.westerndesigncenter.com/wdc/w65c02s-chip.cfm">Western Design Center</a> hergestellt und <a href="http://www.mouser.co.uk/Search/Refine.aspx?Keyword=65C02">an Bastler verkauft</a> werden, also ist 6502 offensichtlich keine tote Sprache! Wer hätte das gedacht?)

source: Seriously though, I think it's valuable to have an understanding of assembly language. Assembly language is the lowest level of abstraction in computers - the point at which the code is still readable. Assembly language translates directly to the bytes that are executed by your computer's processor. If you understand how it works, you've basically become a computer <a href="http://skilldrick.co.uk/2011/04/magic-in-software-development/">magician</a>.
de: Aber ernsthaft, ich denke es ist wertvoll, ein Verständnis für Assemblersprache zu haben. Assemblersprache ist die niedrigste Abstraktionsebene in Computern - der Punkt, an dem der Code noch lesbar ist. Assemblersprache wird direkt in die Bytes übersetzt, die von deinem Computerprozessor ausgeführt werden. Wenn du verstehst, wie es funktioniert, bist du im Grunde ein Computer-<a href="http://skilldrick.co.uk/2011/04/magic-in-software-development/">Magier</a> geworden.

source: Then why 6502? Why not a useful assembly language, like <a href="http://en.wikipedia.org/wiki/X86">x86</a>? Well, I don't think learning x86 is useful. I don't think you'll ever have to write assembly language in your day job - this is purely an academic exercise, something to expand your mind and your thinking. 6502 was originally written in a different age, a time when the majority of developers were writing assembly directly, rather than in these new-fangled high-level programming languages. So, it was designed to be written by humans. More modern assembly languages are meant to written by compilers, so let's leave it to them. Plus, 6502 is fun. Nobody ever called x86 fun.
de: Warum dann 6502? Warum nicht eine nützliche Assemblersprache wie <a href="http://en.wikipedia.org/wiki/X86">x86</a>? Nun, ich denke nicht, dass das Lernen von x86 nützlich ist. Ich glaube nicht, dass du jemals in deinem Arbeitsalltag Assemblersprache schreiben musst - dies ist eine rein akademische Übung, etwas um deinen Geist und dein Denken zu erweitern. 6502 wurde ursprünglich in einer anderen Zeit geschrieben, als die Mehrheit der Entwickler direkt in Assembler programmierte, statt in diesen neumodischen höheren Programmiersprachen. Daher wurde es für Menschen geschrieben. Modernere Assemblersprachen sind dafür gedacht, von Compilern geschrieben zu werden, also überlassen wir es ihnen. Außerdem macht 6502 Spaß. Niemand hat je x86 als spaßig bezeichnet.

source: Our first program
de: Unser erstes Programm
