Repository: JumpLink/Learn6502
Catalog: packages/translations/*.po
Languages: de

source: The hex value <tt>$03</tt> is represented in binary as <tt>00000011</tt>. The <tt>AND</tt> opcode performs a bitwise AND of the argument with the accumulator. For example, if the accumulator contains the binary value <tt>10101010</tt>, then the result of <tt>AND</tt> with <tt>00000011</tt> will be <tt>00000010</tt>.
de: Der Hexadezimalwert <tt>$03</tt> wird binär als <tt>00000011</tt> dargestellt. Der <tt>AND</tt>-Opcode führt eine bitweise UND-Verknüpfung des Arguments mit dem Akkumulator durch. Wenn zum Beispiel der Akkumulator den binären Wert <tt>10101010</tt> enthält, dann wird das Ergebnis von <tt>AND</tt> mit <tt>00000011</tt> <tt>00000010</tt> sein.

source: The effect of this is to mask out the least significant two bits of the accumulator, setting the others to zero. This converts a number in the range of 0–255 to a number in the range of 0–3.
de: Die Wirkung davon ist, die zwei niedrigstwertigen Bits des Akkumulators zu maskieren und die anderen auf Null zu setzen. Dies konvertiert eine Zahl im Bereich von 0-255 in eine Zahl im Bereich von 0-3.

source: After this, the value <tt>2</tt> is added to the accumulator, to create a final random number in the range 2–5.
de: Danach wird der Wert <tt>2</tt> zum Akkumulator addiert, um eine endgültige Zufallszahl im Bereich 2-5 zu erzeugen.

source: The result of this subroutine is to load a random byte into <tt>$00</tt>, and a random number between 2 and 5 into <tt>$01</tt>. Because the least significant byte comes first with indirect addressing, this translates into a memory address between <tt>$0200</tt> and <tt>$05ff</tt>: the exact range used to draw the display.
de: Das Ergebnis dieses Unterprogramms ist, ein zufälliges Byte in <tt>$00</tt> und eine Zufallszahl zwischen 2 und 5 in <tt>$01</tt> zu laden. Da das niedrigstwertige Byte bei indirekter Adressierung zuerst kommt, übersetzt sich dies in eine Speicheradresse zwischen <tt>$0200</tt> und <tt>$05ff</tt>: genau der Bereich, der zum Zeichnen des Displays verwendet wird.

source: The game loop
de: Die Spielschleife

source: Nearly all games have at their heart a game loop. All game loops have the same basic form: accept user input, update the game state, and render the game state. This loop is no different.
de: Fast alle Spiele haben in ihrem Kern eine Spielschleife. Alle Spielschleifen haben die gleiche Grundform: Benutzereingaben annehmen, den Spielzustand aktualisieren und den Spielzustand darstellen. Diese Schleife ist da keine Ausnahme.

source: Reading the input
de: Die Eingabe lesen

source: The first subroutine, <tt>readKeys</tt>, takes the job of accepting user input. The memory location <tt>$ff</tt> holds the ascii code of the most recent key press in this simulator. The value is loaded into the accumulator, then compared to <tt>$77</tt> (the hex code for W), <tt>$64</tt> (D), <tt>$73</tt> (S) and <tt>$61</tt> (A). If any of these comparisons are successful, the program branches to the appropriate section.
de: Das erste Unterprogramm, <tt>readKeys</tt>, übernimmt die Aufgabe, Benutzereingaben anzunehmen. Die Speicheradresse <tt>$ff</tt> enthält den ASCII-Code des letzten Tastendrucks in diesem Simulator. Der Wert wird in den Akkumulator geladen und dann mit <tt>$77</tt> (dem Hexcode für W), <tt>$64</tt> (D), <tt>$73</tt> (S) und <tt>$61</tt> (A) verglichen. Wenn einer dieser Vergleiche erfolgreich ist, verzweigt das Programm zum entsprechenden Abschnitt.

source: Additional button inputs are also available: button A (Enter/Return key, ASCII code <tt>$0D</tt>) and button B (Space key, ASCII code <tt>$20</tt>). These can be used to add more interaction to your games. For directional controls, both WASD keys and arrow keys can be used interchangeably.
de: Zusätzliche Tasteneingaben sind ebenfalls verfügbar: Taste A (Eingabe/Return-Taste, ASCII-Code <tt>$0D</tt>) und Taste B (Leertaste, ASCII-Code <tt>$20</tt>). Diese können genutzt werden, um mehr Interaktion zu deinen Spielen hinzuzufügen. Für die Richtungssteuerung können sowohl WASD-Tasten als auch Pfeiltasten austauschbar verwendet werden.

source: Each section (<tt>upKey</tt>, <tt>rightKey</tt>, etc.) first checks to see if the current direction is the opposite of the new direction. This requires another little detour.
de: Jeder Abschnitt (<tt>upKey</tt>, <tt>rightKey</tt>, usw.) überprüft zuerst, ob die aktuelle Richtung die entgegengesetzte der neuen Richtung ist. Dies erfordert einen weiteren kleinen Umweg.

source: As stated before, the four directions are represented internally by the numbers 1, 2, 4 and 8. Each of these numbers is a power of 2, thus they are represented by a binary number with a single <tt>1</tt>:
de: Wie bereits erwähnt, werden die vier Richtungen intern durch die Zahlen 1, 2, 4 und 8 dargestellt. Jede dieser Zahlen ist eine Zweierpotenz, daher werden sie durch eine Binärzahl mit einer einzigen <tt>1</tt> dargestellt:

source: The <tt>BIT</tt> opcode is similar to <tt>AND</tt>, but the calculation is only used to set the zero flag - the actual result is discarded. The zero flag is set only if the result of AND-ing the accumulator with argument is zero. When we're looking at powers of two, the zero flag will only be set if the two numbers are not the same. For example, <tt>0001 AND 0001</tt> is not zero, but <tt>0001 AND 0010</tt> is zero.
de: Der <tt>BIT</tt>-Opcode ist ähnlich wie <tt>AND</tt>, aber die Berechnung wird nur verwendet, um das Zero-Flag zu setzen - das eigentliche Ergebnis wird verworfen. Das Zero-Flag wird nur gesetzt, wenn das Ergebnis der UND-Verknüpfung des Akkumulators mit dem Argument Null ist. Wenn wir Zweierpotenzen betrachten, wird das Zero-Flag nur gesetzt, wenn die beiden Zahlen nicht gleich sind. Zum Beispiel ist <tt>0001 AND 0001</tt> nicht Null, aber <tt>0001 AND 0010</tt> ist Null.

source: So, looking at <tt>upKey</tt>, if the current direction is down (4), the bit test will be zero. <tt>BNE</tt> means "branch if the zero flag is clear", so in this case we'll branch to <tt>illegalMove</tt>, which just returns from the subroutine. Otherwise, the new direction (1 in this case) is stored in the appropriate memory location.
de: Wenn wir also <tt>upKey</tt> betrachten und die aktuelle Richtung nach unten ist (4), wird der Bit-Test Null sein. <tt>BNE</tt> bedeutet "verzweige, wenn das Zero-Flag nicht gesetzt ist", also werden wir in diesem Fall zu <tt>illegalMove</tt> verzweigen, was einfach aus dem Unterprogramm zurückkehrt. Andernfalls wird die neue Richtung (in diesem Fall 1) in der entsprechenden Speicheradresse gespeichert.

source: Updating the game state
de: Den Spielzustand aktualisieren

source: The next subroutine, <tt>checkCollision</tt>, defers to <tt>checkAppleCollision</tt> and <tt>checkSnakeCollision</tt>. <tt>checkAppleCollision</tt> just checks to see if the two bytes holding the location of the apple match the two bytes holding the location of the head. If they do, the length is increased and a new apple position is generated.
de: Das nächste Unterprogramm, <tt>checkCollision</tt>, delegiert an <tt>checkAppleCollision</tt> und <tt>checkSnakeCollision</tt>. <tt>checkAppleCollision</tt> überprüft nur, ob die zwei Bytes, die die Position des Apfels enthalten, mit den zwei Bytes übereinstimmen, die die Position des Kopfes enthalten. Wenn sie übereinstimmen, wird die Länge erhöht und eine neue Apfelposition generiert.

source: <tt>checkSnakeCollision</tt> loops through the snake's body segments, checking each byte pair against the head pair. If there is a match, then game over.
de: <tt>checkSnakeCollision</tt> durchläuft die Körpersegmente der Schlange und vergleicht jedes Bytepaar mit dem Kopfpaar. Wenn es eine Übereinstimmung gibt, dann ist das Spiel vorbei.

source: After collision detection, we update the snake's location. This is done at a high level like so: First, move each byte pair of the body up one position in memory. Second, update the head according to the current direction. Finally, if the head is out of bounds, handle it as a collision. I'll illustrate this with some ascii art. Each pair of brackets contains an x,y coordinate rather than a pair of bytes for simplicity.
de: Nach der Kollisionserkennung aktualisieren wir die Position der Schlange. Dies wird auf hoher Ebene so gemacht: Zuerst wird jedes Bytepaar des Körpers um eine Position im Speicher nach oben verschoben. Zweitens wird der Kopf entsprechend der aktuellen Richtung aktualisiert. Schließlich wird, wenn der Kopf außerhalb der Grenzen ist, dies als Kollision behandelt. Ich werde dies mit ASCII-Kunst veranschaulichen. Jedes Klammerpaar enthält der Einfachheit halber eine x,y-Koordinate anstelle eines Bytepaars.

source: At a low level, this subroutine is slightly more complex. First, the length is loaded into the <tt>X</tt> register, which is then decremented. The snippet below shows the starting memory for the snake.
de: Auf niedriger Ebene ist dieses Unterprogramm etwas komplexer. Zuerst wird die Länge in das <tt>X</tt>-Register geladen, das dann dekrementiert wird. Der untenstehende Ausschnitt zeigt den Anfangsspeicher für die Schlange.

source: The length is initialized to <tt>4</tt>, so <tt>X</tt> starts off as <tt>3</tt>. <tt>LDA $10,x</tt> loads the value of <tt>$13</tt> into <tt>A</tt>, then <tt>STA $12,x</tt> stores this value into <tt>$15</tt>. <tt>X</tt> is decremented, and we loop. Now <tt>X</tt> is <tt>2</tt>, so we load <tt>$12</tt> and store it into <tt>$14</tt>. This loops while <tt>X</tt> is positive (<tt>BPL</tt> means "branch if positive").
de: Die Länge wird auf <tt>4</tt> initialisiert, also beginnt <tt>X</tt> bei <tt>3</tt>. <tt>LDA $10,x</tt> lädt den Wert von <tt>$13</tt> in <tt>A</tt>, dann speichert <tt>STA $12,x</tt> diesen Wert in <tt>$15</tt>. <tt>X</tt> wird dekrementiert und wir durchlaufen die Schleife. Jetzt ist <tt>X</tt> <tt>2</tt>, also laden wir <tt>$12</tt> und speichern es in <tt>$14</tt>. Dies läuft in einer Schleife, solange <tt>X</tt> positiv ist (<tt>BPL</tt> bedeutet "verzweige wenn positiv").

source: Once the values have been shifted down the snake, we have to work out what to do with the head. The direction is first loaded into <tt>A</tt>. <tt>LSR</tt> means "logical shift right", or "shift all the bits one position to the right". The least significant bit is shifted into the carry flag, so if the accumulator is <tt>1</tt>, after <tt>LSR</tt> it is <tt>0</tt>, with the carry flag set.
de: Sobald die Werte die Schlange hinunter verschoben wurden, müssen wir herausfinden, was mit dem Kopf zu tun ist. Die Richtung wird zuerst in <tt>A</tt> geladen. <tt>LSR</tt> bedeutet "logische Verschiebung nach rechts" oder "verschiebe alle Bits um eine Position nach rechts". Das niedrigstwertige Bit wird in das Carry-Flag verschoben, also wenn der Akkumulator <tt>1</tt> ist, ist er nach <tt>LSR</tt> <tt>0</tt>, wobei das Carry-Flag gesetzt ist.

source: To test whether the direction is <tt>1</tt>, <tt>2</tt>, <tt>4</tt> or <tt>8</tt>, the code continually shifts right until the carry is set. One <tt>LSR</tt> means "up", two means "right", and so on.
de: Um zu testen, ob die Richtung <tt>1</tt>, <tt>2</tt>, <tt>4</tt> oder <tt>8</tt> ist, verschiebt der Code kontinuierlich nach rechts, bis das Carry gesetzt ist. Ein <tt>LSR</tt> bedeutet "nach oben", zwei bedeutet "nach rechts" und so weiter.

source: The next bit updates the head of the snake depending on the direction. This is probably the most complicated part of the code, and it's all reliant on how memory locations map to the screen, so let's look at that in more detail.
de: Der nächste Teil aktualisiert den Kopf der Schlange abhängig von der Richtung. Dies ist wahrscheinlich der komplizierteste Teil des Codes, und es hängt alles davon ab, wie Speicheradressen auf den Bildschirm abgebildet werden, also lass uns das genauer betrachten.

source: You can think of the screen as four horizontal strips of 32 × 8 pixels. These strips map to <tt>$0200-$02ff</tt>, <tt>$0300-$03ff</tt>, <tt>$0400-$04ff</tt> and <tt>$0500-$05ff</tt>. The first rows of pixels are <tt>$0200-$021f</tt>, <tt>$0220-$023f</tt>, <tt>$0240-$025f</tt>, etc.
de: Du kannst dir den Bildschirm als vier horizontale Streifen von 32 × 8 Pixeln vorstellen. Diese Streifen werden auf <tt>$0200-$02ff</tt>, <tt>$0300-$03ff</tt>, <tt>$0400-$04ff</tt> und <tt>$0500-$05ff</tt> abgebildet. Die ersten Pixelreihen sind <tt>$0200-$021f</tt>, <tt>$0220-$023f</tt>, <tt>$0240-$025f</tt>, usw.

source: As long as you're moving within one of these horizontal strips, things are simple. For example, to move right, just increment the least significant byte (e.g. <tt>$0200</tt> becomes <tt>$0201</tt>). To go down, add <tt>$20</tt> (e.g. <tt>$0200</tt> becomes <tt>$0220</tt>). Left and up are the reverse.
de: Solange du dich innerhalb eines dieser horizontalen Streifen bewegst, sind die Dinge einfach. Um zum Beispiel nach rechts zu gehen, erhöhe einfach das niedrigstwertige Byte (z.B. wird aus <tt>$0200</tt> dann <tt>$0201</tt>). Um nach unten zu gehen, addiere <tt>$20</tt> (z.B. wird aus <tt>$0200</tt> dann <tt>$0220</tt>). Links und oben sind die Umkehrung davon.

source: Going between sections is more complicated, as we have to take into account the most significant byte as well. For example, going down from <tt>$02e1</tt> should lead to <tt>$0301</tt>. Luckily, this is fairly easy to accomplish. Adding <tt>$20</tt> to <tt>$e1</tt> results in <tt>$01</tt> and sets the carry bit. If the carry bit was set, we know we also need to increment the most significant byte.
de: Der Übergang zwischen den Abschnitten ist komplizierter, da wir auch das höchstwertige Byte berücksichtigen müssen. Zum Beispiel sollte das Heruntergehen von <tt>$02e1</tt> zu <tt>$0301</tt> führen. Glücklicherweise ist dies ziemlich einfach zu erreichen. Die Addition von <tt>$20</tt> zu <tt>$e1</tt> ergibt <tt>$01</tt> und setzt das Carry-Bit. Wenn das Carry-Bit gesetzt wurde, wissen wir, dass wir auch das höchstwertige Byte erhöhen müssen.

source: After a move in each direction, we also need to check to see if the head would become out of bounds. This is handled differently for each direction. For left and right, we can check to see if the head has effectively "wrapped around". Going right from <tt>$021f</tt> by incrementing the least significant byte would lead to <tt>$0220</tt>, but this is actually jumping from the last pixel of the first row to the first pixel of the second row. So, every time we move right, we need to check if the new least significant byte is a multiple of <tt>$20</tt>. This is done using a bit check against the mask <tt>$1f</tt>. Hopefully the illustration below will show you how masking out the lowest 5 bits reveals whether a number is a multiple of <tt>$20</tt> or not.
de: Nach einer Bewegung in jede Richtung müssen wir auch überprüfen, ob der Kopf außerhalb der Grenzen geraten würde. Dies wird für jede Richtung unterschiedlich gehandhabt. Für links und rechts können wir überprüfen, ob der Kopf effektiv "umgebrochen" ist. Wenn man von <tt>$021f</tt> nach rechts geht, indem man das niedrigstwertige Byte erhöht, würde dies zu <tt>$0220</tt> führen, aber das bedeutet eigentlich einen Sprung vom letzten Pixel der ersten Zeile zum ersten Pixel der zweiten Zeile. Also müssen wir jedes Mal, wenn wir nach rechts gehen, überprüfen, ob das neue niedrigstwertige Byte ein Vielfaches von <tt>$20</tt> ist. Dies geschieht durch eine Bit-Prüfung gegen die Maske <tt>$1f</tt>. Die Illustration unten wird hoffentlich zeigen, wie das Maskieren der niedrigsten 5 Bits offenbart, ob eine Zahl ein Vielfaches von <tt>$20</tt> ist oder nicht.

source: I won't explain in depth how each of the directions work, but the above explanation should give you enough to work it out with a bit of study.
de: Ich werde nicht im Detail erklären, wie jede der Richtungen funktioniert, aber die obige Erklärung sollte dir genug geben, um es mit etwas Studium selbst herauszufinden.

source: Rendering the game
de: Das Spiel darstellen

source: Because the game state is stored in terms of pixel locations, rendering the game is very straightforward. The first subroutine, <tt>drawApple</tt>, is extremely simple. It sets <tt>Y</tt> to zero, loads a random colour into the accumulator, then stores this value into <tt>($00),y</tt>. <tt>$00</tt> is where the location of the apple is stored, so <tt>($00),y</tt> dereferences to this memory location. Read the "Indirect indexed" section in <a href="#addressing">Addressing modes</a> for more details.
de: Da der Spielzustand in Form von Pixelpositionen gespeichert wird, ist die Darstellung des Spiels sehr einfach. Das erste Unterprogramm, <tt>drawApple</tt>, ist extrem einfach. Es setzt <tt>Y</tt> auf Null, lädt eine zufällige Farbe in den Akkumulator und speichert diesen Wert dann in <tt>($00),y</tt>. <tt>$00</tt> ist der Ort, an dem die Position des Apfels gespeichert ist, also dereferenziert <tt>($00),y</tt> zu dieser Speicheradresse. Lies den Abschnitt "Indirekt indiziert" in <a href="#addressing">Adressierungsmodi</a> für weitere Details.

source: Next comes <tt>drawSnake</tt>. This is pretty simple too - we first undraw the tail and then draw the head. <tt>X</tt> is set to the length of the snake, so we can index to the right pixel, and we set <tt>A</tt> to zero then perform the write using the indexed indirect addressing mode. Then we reload <tt>X</tt> to index to the head, set <tt>A</tt> to one and store it at <tt>($10,x)</tt>. <tt>$10</tt> stores the two-byte location of the head, so this draws a white pixel at the current head position. As only the head and the tail of the snake move, this is enough to keep the snake moving.
de: Als nächstes kommt <tt>drawSnake</tt>. Dies ist auch ziemlich einfach - wir löschen zuerst den Schwanz und zeichnen dann den Kopf. <tt>X</tt> wird auf die Länge der Schlange gesetzt, damit wir zum richtigen Pixel indexieren können, und wir setzen <tt>A</tt> auf Null und führen dann das Schreiben mit dem indizierten indirekten Adressierungsmodus durch. Dann laden wir <tt>X</tt> neu, um zum Kopf zu indexieren, setzen <tt>A</tt> auf eins und speichern es in <tt>($10,x)</tt>. <tt>$10</tt> speichert die zweibyte-Position des Kopfes, also zeichnet dies einen weißen Pixel an der aktuellen Kopfposition. Da sich nur der Kopf und der Schwanz der Schlange bewegen, reicht dies aus, um die Schlange in Bewegung zu halten.

source: The last subroutine, <tt>spinWheels</tt>, is just there because the game would run too fast otherwise. All <tt>spinWheels</tt> does is count <tt>X</tt> down from zero until it hits zero again. The first <tt>dex</tt> wraps, making <tt>X</tt> <tt>#$ff</tt>.
de: Das letzte Unterprogramm, <tt>spinWheels</tt>, ist nur da, weil das Spiel sonst zu schnell laufen würde. Alles, was <tt>spinWheels</tt> tut, ist <tt>X</tt> von Null herunterzuzählen, bis es wieder Null erreicht. Das erste <tt>dex</tt> überläuft, wodurch <tt>X</tt> zu <tt>#$ff</tt> wird.
