Repository: JumpLink/Learn6502
Catalog: packages/translations/*.po
Languages: de

source: <tt>a9</tt> and <tt>c9</tt> are the processor opcodes for immediate-addressed <tt>LDA</tt> and <tt>CMP</tt> respectively. <tt>01</tt> and <tt>02</tt> are the arguments to these instructions. <tt>d0</tt> is the opcode for <tt>BNE</tt>, and its argument is <tt>02</tt>. This means "skip over the next two bytes" (<tt>85 22</tt>, the assembled version of <tt>STA $22</tt>). Try editing the code so <tt>STA</tt> takes a two-byte absolute address rather than a single-byte zero page address (e.g. change <tt>STA $22</tt> to <tt>STA $2222</tt>). Reassemble the code and look at the hexdump again - the argument to <tt>BNE</tt> should now be <tt>03</tt>, because the instruction the processor is skipping past is now three bytes long.
de: <tt>a9</tt> und <tt>c9</tt> sind die Prozessor-Opcodes für unmittelbar adressierte <tt>LDA</tt> und <tt>CMP</tt>. <tt>01</tt> und <tt>02</tt> sind die Argumente für diese Anweisungen. <tt>d0</tt> ist der Opcode für <tt>BNE</tt>, und sein Argument ist <tt>02</tt>. Dies bedeutet "überspringe die nächsten zwei Bytes" (<tt>85 22</tt>, die assemblierte Version von <tt>STA $22</tt>). Versuche den Code so zu ändern, dass <tt>STA</tt> eine zweibyte absolute Adresse anstelle einer einbyte Nullseiten-Adresse verwendet (z.B. ändere <tt>STA $22</tt> zu <tt>STA $2222</tt>). Assembliere den Code neu und schaue dir den Hexdump erneut an - das Argument für <tt>BNE</tt> sollte jetzt <tt>03</tt> sein, weil die Anweisung, die der Prozessor überspringt, jetzt drei Bytes lang ist.

source: Implicit
de: Implizit

source: Some instructions don't deal with memory locations (e.g. <tt>INX</tt> - increment the <tt>X</tt> register). These are said to have implicit addressing - the argument is implied by the instruction.
de: Einige Anweisungen arbeiten nicht mit Speicheradressen (z.B. <tt>INX</tt> - inkrementiere das <tt>X</tt>-Register). Diese haben eine implizite Adressierung - das Argument ergibt sich aus der Anweisung selbst.

source: Indirect: <tt>($c000)</tt>
de: Indirekt: <tt>($c000)</tt>

source: Indirect addressing uses an absolute address to look up another address. The first address gives the least significant byte of the address, and the following byte gives the most significant byte. That can be hard to wrap your head around, so here's an example:
de: Indirekte Adressierung verwendet eine absolute Adresse, um eine andere Adresse nachzuschlagen. Die erste Adresse liefert das niedrigstwertige Byte der Adresse, und das folgende Byte liefert das höchstwertige Byte. Das kann schwer zu verstehen sein, hier ist ein Beispiel:

source: In this example, <tt>$f0</tt> contains the value <tt>$01</tt> and <tt>$f1</tt> contains the value <tt>$cc</tt>. The instruction <tt>JMP ($f0)</tt> causes the processor to look up the two bytes at <tt>$f0</tt> and <tt>$f1</tt> (<tt>$01</tt> and <tt>$cc</tt>) and put them together to form the address <tt>$cc01</tt>, which becomes the new program counter. Assemble and step through the program above to see what happens. I'll talk more about <tt>JMP</tt> in the section on <a href="#jumping">Jumping</a>.
de: In diesem Beispiel enthält <tt>$f0</tt> den Wert <tt>$01</tt> und <tt>$f1</tt> enthält den Wert <tt>$cc</tt>. Die Anweisung <tt>JMP ($f0)</tt> veranlasst den Prozessor, die zwei Bytes bei <tt>$f0</tt> und <tt>$f1</tt> (<tt>$01</tt> und <tt>$cc</tt>) nachzuschlagen und sie zur Adresse <tt>$cc01</tt> zusammenzufügen, die dann zum neuen Programmzähler wird. Assembliere und gehe das obige Programm schrittweise durch, um zu sehen, was passiert. Ich werde mehr über <tt>JMP</tt> im Abschnitt über <a href="#jumping">Springen</a> sprechen.

source: Indexed indirect: <tt>($c0,X)</tt>
de: Indiziert indirekt: <tt>($c0,X)</tt>

source: This one's kinda weird. It's like a cross between zero page,X and indirect. Basically, you take the zero page address, add the value of the <tt>X</tt> register to it, then use that to look up a two-byte address. For example:
de: Diese ist etwas seltsam. Es ist wie eine Kreuzung zwischen Nullseite,X und indirekt. Im Grunde nimmst du die Nullseiten-Adresse, addierst den Wert des <tt>X</tt>-Registers dazu und verwendest das dann, um eine zweibyte-Adresse nachzuschlagen. Zum Beispiel:

source: Memory locations <tt>$01</tt> and <tt>$02</tt> contain the values <tt>$05</tt> and <tt>$07</tt> respectively. Think of <tt>($00,X)</tt> as <tt>($00 + X)</tt>. In this case <tt>X</tt> is <tt>$01</tt>, so this simplifies to <tt>($01)</tt>. From here things proceed like standard indirect addressing - the two bytes at <tt>$01</tt> and <tt>$02</tt> (<tt>$05</tt> and <tt>$07</tt>) are looked up to form the address <tt>$0705</tt>. This is the address that the <tt>Y</tt> register was stored into in the previous instruction, so the <tt>A</tt> register gets the same value as <tt>Y</tt>, albeit through a much more circuitous route. You won't see this much.
de: Die Speicheradressen <tt>$01</tt> und <tt>$02</tt> enthalten die Werte <tt>$05</tt> bzw. <tt>$07</tt>. Denke an <tt>($00,X)</tt> als <tt>($00 + X)</tt>. In diesem Fall ist <tt>X</tt> gleich <tt>$01</tt>, also vereinfacht sich das zu <tt>($01)</tt>. Von hier aus läuft es wie bei der standardmäßigen indirekten Adressierung - die zwei Bytes bei <tt>$01</tt> und <tt>$02</tt> (<tt>$05</tt> und <tt>$07</tt>) werden nachgeschlagen, um die Adresse <tt>$0705</tt> zu bilden. Dies ist die Adresse, in die das <tt>Y</tt>-Register in der vorherigen Anweisung gespeichert wurde, sodass das <tt>A</tt>-Register den gleichen Wert wie <tt>Y</tt> erhält, wenn auch auf einem viel umständlicheren Weg. Das wirst du nicht oft sehen.

source: Indirect indexed: <tt>($c0),Y</tt>
de: Indirekt indiziert: <tt>($c0),Y</tt>

source: Indirect indexed is like indexed indirect but less insane. Instead of adding the <tt>X</tt> register to the address before dereferencing, the zero page address is dereferenced, and the <tt>Y</tt> register is added to the resulting address.
de: Indirekt indiziert ist wie indiziert indirekt, aber weniger verrückt. Anstatt das <tt>X</tt>-Register vor dem Dereferenzieren zur Adresse zu addieren, wird die Nullseiten-Adresse dereferenziert und das <tt>Y</tt>-Register zur resultierenden Adresse addiert.

source: In this case, <tt>($01)</tt> looks up the two bytes at <tt>$01</tt> and <tt>$02</tt>: <tt>$03</tt> and <tt>$07</tt>. These form the address <tt>$0703</tt>. The value of the <tt>Y</tt> register is added to this address to give the final address <tt>$0704</tt>.
de: In diesem Fall schlägt <tt>($01)</tt> die zwei Bytes bei <tt>$01</tt> und <tt>$02</tt> nach: <tt>$03</tt> und <tt>$07</tt>. Diese bilden die Adresse <tt>$0703</tt>. Der Wert des <tt>Y</tt>-Registers wird zu dieser Adresse addiert, um die endgültige Adresse <tt>$0704</tt> zu erhalten.

source: Exercise
de: Übung

source: Try to write code snippets that use each of the 6502 addressing modes. Remember, you can use the monitor in the debugger to watch a section of memory.
de: Versuche Code-Beispiele zu schreiben, die jeden der 6502-Adressierungsmodi verwenden. Denk daran, dass du den Monitor im Debugger verwenden kannst, um einen Speicherbereich zu beobachten.

source: The stack
de: Der Stack

source: The stack in a 6502 processor is just like any other stack - values are pushed onto it and popped ("pulled" in 6502 parlance) off it. The current depth of the stack is measured by the stack pointer, a special register. The stack lives in memory between <tt>$0100</tt> and <tt>$01ff</tt>. The stack pointer is initially <tt>$ff</tt>, which points to memory location <tt>$01ff</tt>. When a byte is pushed onto the stack, the stack pointer becomes <tt>$fe</tt>, or memory location <tt>$01fe</tt>, and so on.
de: Der Stack in einem 6502-Prozessor ist wie jeder andere Stack - Werte werden darauf geschoben (gepusht) und davon genommen ("gepullt" in 6502-Sprache). Die aktuelle Tiefe des Stacks wird durch den Stack-Pointer gemessen, ein spezielles Register. Der Stack befindet sich im Speicher zwischen <tt>$0100</tt> und <tt>$01ff</tt>. Der Stack-Pointer ist anfangs <tt>$ff</tt>, was auf die Speicheradresse <tt>$01ff</tt> zeigt. Wenn ein Byte auf den Stack geschoben wird, wird der Stack-Pointer zu <tt>$fe</tt>, oder Speicheradresse <tt>$01fe</tt>, und so weiter.

source: Two of the stack instructions are <tt>PHA</tt> and <tt>PLA</tt>, "push accumulator" and "pull accumulator". Below is an example of these two in action.
de: Zwei der Stack-Anweisungen sind <tt>PHA</tt> und <tt>PLA</tt>, "push accumulator" und "pull accumulator". Unten ist ein Beispiel dieser beiden in Aktion.

source: <tt>X</tt> holds the pixel colour, and <tt>Y</tt> holds the position of the current pixel. The first loop draws the current colour as a pixel (via the <tt>A</tt> register), pushes the colour to the stack, then increments the colour and position. The second loop pops the stack, draws the popped colour as a pixel, then increments the position. As should be expected, this creates a mirrored pattern.
de: <tt>X</tt> enthält die Pixelfarbe und <tt>Y</tt> enthält die Position des aktuellen Pixels. Die erste Schleife zeichnet die aktuelle Farbe als Pixel (über das <tt>A</tt>-Register), schiebt die Farbe auf den Stack und erhöht dann die Farbe und Position. Die zweite Schleife nimmt die Farbe vom Stack, zeichnet die genommene Farbe als Pixel und erhöht dann die Position. Wie zu erwarten, erzeugt dies ein gespiegeltes Muster.

source: Jumping
de: Springen

source: Jumping is like branching with two main differences. First, jumps are not conditionally executed, and second, they take a two-byte absolute address. For small programs, this second detail isn't very important, as you'll mostly be using labels, and the assembler works out the correct memory location from the label. For larger programs though, jumping is the only way to move from one section of the code to another.
de: Springen ist wie Verzweigen mit zwei Hauptunterschieden. Erstens werden Sprünge nicht bedingt ausgeführt, und zweitens verwenden sie eine zweibyte absolute Adresse. Für kleine Programme ist dieses zweite Detail nicht sehr wichtig, da du hauptsächlich Labels verwendest und der Assembler die korrekte Speicheradresse aus dem Label ermittelt. Für größere Programme ist Springen jedoch der einzige Weg, um von einem Codeabschnitt zu einem anderen zu gelangen.

source: <tt>JMP</tt> is an unconditional jump. Here's a really simple example to show it in action:
de: <tt>JMP</tt> ist ein unbedingter Sprung. Hier ist ein sehr einfaches Beispiel, um es in Aktion zu zeigen:

source: <tt>JSR</tt> and <tt>RTS</tt> ("jump to subroutine" and "return from subroutine") are a dynamic duo that you'll usually see used together. <tt>JSR</tt> is used to jump from the current location to another part of the code. <tt>RTS</tt> returns to the previous position. This is basically like calling a function and returning.
de: <tt>JSR</tt> und <tt>RTS</tt> ("jump to subroutine" und "return from subroutine") sind ein dynamisches Duo, das du normalerweise zusammen verwendet siehst. <tt>JSR</tt> wird verwendet, um von der aktuellen Position zu einem anderen Teil des Codes zu springen. <tt>RTS</tt> kehrt zur vorherigen Position zurück. Dies ist im Grunde wie ein Funktionsaufruf und die Rückkehr daraus.

source: The processor knows where to return to because <tt>JSR</tt> pushes the address minus one of the next instruction onto the stack before jumping to the given location. <tt>RTS</tt> pops this location, adds one to it, and jumps to that location. An example:
de: Der Prozessor weiß, wohin er zurückkehren soll, weil <tt>JSR</tt> die Adresse der nächsten Anweisung minus eins auf den Stack schiebt, bevor er zur angegebenen Position springt. <tt>RTS</tt> nimmt diese Position vom Stack, addiert eins dazu und springt zu dieser Position. Ein Beispiel:

source: The first instruction causes execution to jump to the <tt>init</tt> label. This sets <tt>X</tt>, then returns to the next instruction, <tt>JSR loop</tt>. This jumps to the <tt>loop</tt> label, which increments <tt>X</tt> until it is equal to <tt>$05</tt>. After that we return to the next instruction, <tt>JSR end</tt>, which jumps to the end of the file. This illustrates how <tt>JSR</tt> and <tt>RTS</tt> can be used together to create modular code.
de: Die erste Anweisung veranlasst die Ausführung zum <tt>init</tt>-Label zu springen. Dies setzt <tt>X</tt> und kehrt dann zur nächsten Anweisung zurück, <tt>JSR loop</tt>. Dies springt zum <tt>loop</tt>-Label, das <tt>X</tt> erhöht, bis es gleich <tt>$05</tt> ist. Danach kehren wir zur nächsten Anweisung zurück, <tt>JSR end</tt>, die zum Ende der Datei springt. Dies zeigt, wie <tt>JSR</tt> und <tt>RTS</tt> zusammen verwendet werden können, um modularen Code zu erstellen.

source: Creating a game
de: Ein Spiel erstellen

source: Now, let's put all this knowledge to good use, and make a game! We're going to be making a really simple version of the classic game 'Snake'.
de: Jetzt lass uns all dieses Wissen gut nutzen und ein Spiel erstellen! Wir werden eine sehr einfache Version des klassischen Spiels 'Snake' erstellen.

source: Even though this will be a simple version, the code will be substantially larger than all the previous examples. We will need to keep track of several memory locations together for the various aspects of the game. We can still do the necessary bookkeeping throughout the program ourselves, as before, but on a larger scale that quickly becomes tedious and can also lead to bugs that are difficult to spot. Instead we'll now let the assembler do some of the mundane work for us.
de: Auch wenn dies eine einfache Version sein wird, wird der Code wesentlich umfangreicher sein als alle bisherigen Beispiele. Wir müssen mehrere Speicheradressen für die verschiedenen Aspekte des Spiels im Auge behalten. Wir können die notwendige Buchführung im Programm immer noch selbst durchführen, wie zuvor, aber in größerem Umfang wird das schnell mühsam und kann auch zu schwer zu findenden Fehlern führen. Stattdessen lassen wir jetzt den Assembler einen Teil der alltäglichen Arbeit für uns erledigen.

source: In this assembler, we can define descriptive constants (or symbols) that represent numbers. The rest of the code can then simply use the constants instead of the literal number, which immediately makes it obvious what we're dealing with. You can use letters, digits and underscores in a name.
de: In diesem Assembler können wir beschreibende Konstanten (oder Symbole) definieren, die Zahlen repräsentieren. Der restliche Code kann dann einfach die Konstanten anstelle der wörtlichen Zahl verwenden, was sofort deutlich macht, womit wir es zu tun haben. Du kannst Buchstaben, Ziffern und Unterstriche in einem Namen verwenden.

source: Here's an example. Note that immediate operands are still prefixed with a <tt>#</tt>.
de: Hier ist ein Beispiel. Beachte, dass unmittelbare Operanden immer noch mit einem <tt>#</tt> beginnen.

source: The code block below contains the entire source code of the game. I'll explain how it works in the following sections.
de: Der Code-Block unten enthält den gesamten Quellcode des Spiels. Ich werde in den folgenden Abschnitten erklären, wie es funktioniert.

source: <a href="https://twitter.com/wkjagt">Willem van der Jagt</a> made a <a href="https://gist.github.com/wkjagt/9043907">fully annotated gist of this source code</a>, so follow along with that for more details.
de: <a href="https://twitter.com/wkjagt">Willem van der Jagt</a> hat einen <a href="https://gist.github.com/wkjagt/9043907">vollständig kommentierten Gist dieses Quellcodes</a> erstellt, folge diesem für weitere Details.

source: Overall structure
de: Gesamtstruktur

source: After the initial block of comments (lines starting with semicolons), the first two lines are:
de: Nach dem anfänglichen Block von Kommentaren (Zeilen, die mit Semikolons beginnen), sind die ersten beiden Zeilen:

source: <tt>init</tt> and <tt>loop</tt> are both subroutines. <tt>init</tt> initializes the game state, and <tt>loop</tt> is the main game loop.
de: <tt>init</tt> und <tt>loop</tt> sind beide Unterprogramme. <tt>init</tt> initialisiert den Spielzustand, und <tt>loop</tt> ist die Hauptspielschleife.

source: The <tt>loop</tt> subroutine itself just calls a number of subroutines sequentially, before looping back on itself:
de: Das <tt>loop</tt>-Unterprogramm selbst ruft nur eine Reihe von Unterprogrammen nacheinander auf, bevor es zu sich selbst zurückkehrt:

source: First, <tt>readkeys</tt> checks to see if one of the direction keys (W, A, S, D) was pressed, and if so, sets the direction of the snake accordingly. Then, <tt>checkCollision</tt> checks to see if the snake collided with itself or the apple. <tt>updateSnake</tt> updates the internal representation of the snake, based on its direction. Next, the apple and snake are drawn. Finally, <tt>spinWheels</tt> makes the processor do some busy work, to stop the game from running too quickly. Think of it like a sleep command. The game keeps running until the snake collides with the wall or itself.
de: Zuerst überprüft <tt>readkeys</tt>, ob eine der Richtungstasten (W, A, S, D) gedrückt wurde, und setzt entsprechend die Richtung der Schlange. Dann überprüft <tt>checkCollision</tt>, ob die Schlange mit sich selbst oder dem Apfel kollidiert ist. <tt>updateSnake</tt> aktualisiert die interne Darstellung der Schlange basierend auf ihrer Richtung. Als nächstes werden der Apfel und die Schlange gezeichnet. Schließlich lässt <tt>spinWheels</tt> den Prozessor etwas Leerlaufarbeit machen, damit das Spiel nicht zu schnell läuft. Denk daran wie an einen Sleep-Befehl. Das Spiel läuft weiter, bis die Schlange mit der Wand oder sich selbst kollidiert.

source: Zero page usage
de: Verwendung der Nullseite

source: The zero page of memory is used to store a number of game state variables, as noted in the comment block at the top of the game. Everything in <tt>$00</tt>, <tt>$01</tt> and <tt>$10</tt> upwards is a pair of bytes representing a two-byte memory location that will be looked up using indirect addressing. These memory locations will all be between <tt>$0200</tt> and <tt>$05ff</tt> - the section of memory corresponding to the game console. For example, if <tt>$00</tt> and <tt>$01</tt> contained the values <tt>$01</tt> and <tt>$02</tt>, they would be referring to the second pixel of the display ( <tt>$0201</tt> - remember, the least significant byte comes first in indirect addressing).
de: Die Zero Page wird verwendet, um verschiedene Spielzustandsvariablen zu speichern, wie im Kommentarblock am Anfang des Spiels beschrieben. Die Bereiche <tt>$00</tt>, <tt>$01</tt> und ab <tt>$10</tt> aufwärts enthalten jeweils Bytepaare, die eine 2-Byte-Speicheradresse darstellen und über Indirect Addressing nachgeschlagen werden. Diese Speicheradressen liegen alle zwischen <tt>$0200</tt> und <tt>$05ff</tt> - dem Speicherbereich des Spielkonsolen-Displays. Wenn zum Beispiel <tt>$00</tt> und <tt>$01</tt> die Werte <tt>$01</tt> und <tt>$02</tt> enthalten, verweisen sie auf das zweite Pixel des Displays (<tt>$0201</tt> - beachte, dass bei Indirect Addressing das Least Significant Byte zuerst kommt).

source: The first two bytes hold the location of the apple. This is updated every time the snake eats the apple. Byte <tt>$02</tt> contains the current direction. <tt>1</tt> means up, <tt>2</tt> right, <tt>4</tt> down, and <tt>8</tt> left. The reasoning behind these numbers will become clear later.
de: Die ersten zwei Bytes enthalten die Position des Apfels. Diese wird jedes Mal aktualisiert, wenn die Schlange den Apfel frisst. Byte <tt>$02</tt> enthält die aktuelle Richtung. <tt>1</tt> bedeutet nach oben, <tt>2</tt> nach rechts, <tt>4</tt> nach unten und <tt>8</tt> nach links. Die Logik hinter diesen Zahlen wird später klar werden.

source: Finally, byte <tt>$03</tt> contains the current length of the snake, in terms of bytes in memory (so a length of 4 means 2 pixels).
de: Schließlich enthält Byte <tt>$03</tt> die aktuelle Länge der Schlange, gemessen in Bytes im Speicher (eine Länge von 4 bedeutet also 2 Pixel).

source: Initialization
de: Initialisierung

source: The <tt>init</tt> subroutine defers to two subroutines, <tt>initSnake</tt> and <tt>generateApplePosition</tt>. <tt>initSnake</tt> sets the snake direction, length, and then loads the initial memory locations of the snake head and body. The byte pair at <tt>$10</tt> contains the screen location of the head, the pair at <tt>$12</tt> contains the location of the single body segment, and <tt>$14</tt> contains the location of the tail (the tail is the last segment of the body and is drawn in black to keep the snake moving). This happens in the following code:
de: Die <tt>init</tt>-Subroutine ruft zwei weitere Subroutinen auf: <tt>initSnake</tt> und <tt>generateApplePosition</tt>. <tt>initSnake</tt> legt die Richtung und Länge der Schlange fest und lädt dann die initialen Speicherpositionen für Kopf und Körper. Das Bytepaar bei <tt>$10</tt> enthält die Bildschirmposition des Kopfes, das Paar bei <tt>$12</tt> die Position des Körpersegments und <tt>$14</tt> die Position des Schwanzes (der Schwanz ist das letzte Segment des Körpers und wird schwarz dargestellt, damit die Bewegung der Schlange sichtbar wird). Dies geschieht im folgenden Code:

source: This loads the value <tt>$11</tt> into the memory location <tt>$10</tt>, the value <tt>$10</tt> into <tt>$12</tt>, and <tt>$0f</tt> into <tt>$14</tt>. It then loads the value <tt>$04</tt> into <tt>$11</tt>, <tt>$13</tt> and <tt>$15</tt>. This leads to memory like this:
de: Dies lädt den Wert <tt>$11</tt> in die Speicheradresse <tt>$10</tt>, den Wert <tt>$10</tt> in <tt>$12</tt> und <tt>$0f</tt> in <tt>$14</tt>. Dann lädt es den Wert <tt>$04</tt> in <tt>$11</tt>, <tt>$13</tt> und <tt>$15</tt>. Dies führt zu Speicher wie diesem:

source: which represents the indirectly-addressed memory locations <tt>$0411</tt>, <tt>$0410</tt> and <tt>$040f</tt> (three pixels in the middle of the display). I'm labouring this point, but it's important to fully grok how indirect addressing works.
de: was die indirekt adressierten Speicheradressen <tt>$0411</tt>, <tt>$0410</tt> und <tt>$040f</tt> repräsentiert (drei Pixel in der Mitte des Displays). Ich betone diesen Punkt, aber es ist wichtig, vollständig zu verstehen, wie indirekte Adressierung funktioniert.

source: The next subroutine, <tt>generateApplePosition</tt>, sets the apple location to a random position on the display. First, it loads a random byte into the accumulator (<tt>$fe</tt> is a random number generator in this simulator). This is stored into <tt>$00</tt>. Next, a different random byte is loaded into the accumulator, which is then <tt>AND</tt>-ed with the value <tt>$03</tt>. This part requires a bit of a detour.
de: Das nächste Unterprogramm, <tt>generateApplePosition</tt>, setzt die Apfelposition auf eine zufällige Position auf dem Display. Zuerst lädt es ein zufälliges Byte in den Akkumulator (<tt>$fe</tt> ist ein Zufallszahlengenerator in diesem Simulator). Dies wird in <tt>$00</tt> gespeichert. Als nächstes wird ein anderes zufälliges Byte in den Akkumulator geladen, das dann mit dem Wert <tt>$03</tt> <tt>AND</tt>-verknüpft wird. Dieser Teil erfordert einen kleinen Umweg.
