Repository: JumpLink/Learn6502
Catalog: packages/translations/*.po
Languages: de

source: So, let's dive in! This application contains a <a href="https://github.com/skilldrick/6502js">JavaScript 6502 Assembler and Simulator</a> that I have adapted for this interactive tutorial. Click the <b>Copy</b> button in the code block below to copy the example code to the editor. Then click the button in the top right to assemble the code, then click it again to run the program. You can also access these actions through the dropdown menu.
de: Also, lass uns loslegen! Diese Anwendung enthält einen <a href="https://github.com/skilldrick/6502js">JavaScript 6502 Assembler und Simulator</a>, den ich für dieses interaktive Tutorial angepasst habe. Klicke auf den <b>Kopieren</b>-Button im Code-Block unten, um den Beispielcode in den Editor zu kopieren. Klicke dann auf den Button oben rechts, um den Code zu assemblieren, und klicke erneut, um das Programm auszuführen. Diese Aktionen kannst du auch über das Dropdown-Menü aufrufen.

source: The black game console screen now should show three coloured "pixels" at the top left.
de: Der schwarze Spielkonsolenbildschirm sollte jetzt drei farbige "Pixel" oben links zeigen.

source: So, what's this program actually doing? Let's step through it. Hit <b>Reset</b>, then select <b>Step</b> from the dropdown menu. The button will switch to step mode, allowing you to execute the program one instruction at a time. Click once and you'll notice in the debugger that <tt>A=</tt> changed from <tt>$00</tt> to <tt>$01</tt>, and <tt>PC=</tt> changed from <tt>$0600</tt> to <tt>$0602</tt>.
de: Was macht dieses Programm eigentlich? Lass uns es Schritt für Schritt durchgehen. Klicke auf <b>Zurücksetzen</b> und wähle dann <b>Schritt</b> aus dem Dropdown-Menü. Der Button wechselt in den Schritt-Modus, wodurch du das Programm Anweisung für Anweisung ausführen kannst. Nach einem Klick wirst du im Debugger sehen, dass sich <tt>A=</tt> von <tt>$00</tt> zu <tt>$01</tt> und <tt>PC=</tt> von <tt>$0600</tt> zu <tt>$0602</tt> geändert hat.

source: Any numbers prefixed with <tt>$</tt> in 6502 assembly language (and by extension, in this book) are in hexadecimal (hex) format. If you're not familiar with hex numbers, I recommend you read <a href="http://en.wikipedia.org/wiki/Hexadecimal">the Wikipedia article</a>. Anything prefixed with <tt>#</tt> is a literal number value. Any other number refers to a memory location.
de: Alle Zahlen mit dem Präfix <tt>$</tt> in der 6502-Assemblersprache (und folglich auch in diesem Buch) sind im Hexadezimal-(Hex)-Format. Wenn du mit Hexadezimalzahlen nicht vertraut bist, empfehle ich dir, <a href="http://en.wikipedia.org/wiki/Hexadecimal">den Wikipedia-Artikel</a> zu lesen. Alles mit dem Präfix <tt>#</tt> ist ein Literalwert. Alle anderen Zahlen beziehen sich auf Speicheradressen.

source: Equipped with that knowledge, you should be able to see that the instruction <tt>LDA #$01</tt> loads the hex value <tt>$01</tt> into register <tt>A</tt>. I'll go into more detail on registers in the next section.
de: Mit diesem Wissen solltest du erkennen können, dass die Anweisung <tt>LDA #$01</tt> den Hexadezimalwert <tt>$01</tt> in das Register <tt>A</tt> lädt. Ich werde im nächsten Abschnitt näher auf Register eingehen.

source: Press <b>Step</b> again to execute the second instruction. The top-left pixel of the game console should now be white. This simulator uses the memory locations <tt>$0200</tt> to <tt>$05ff</tt> to draw pixels on its display. The values <tt>$00</tt> to <tt>$0f</tt> represent 16 different colours (<tt>$00</tt> is black and <tt>$01</tt> is white), so storing the value <tt>$01</tt> at memory location <tt>$0200</tt> draws a white pixel at the top left corner. This is simpler than how an actual computer would output video, but it'll do for now.
de: Drücke erneut <b>Schritt</b>, um die zweite Anweisung auszuführen. Das Pixel oben links in der Spielkonsole sollte jetzt weiß sein. Dieser Simulator verwendet die Speicheradressen von <tt>$0200</tt> bis <tt>$05ff</tt>, um Pixel auf seinem Display zu zeichnen. Die Werte von <tt>$00</tt> bis <tt>$0f</tt> repräsentieren 16 verschiedene Farben (<tt>$00</tt> ist schwarz und <tt>$01</tt> ist weiß), daher zeichnet das Speichern des Wertes <tt>$01</tt> an der Speicheradresse <tt>$0200</tt> ein weißes Pixel in der oberen linken Ecke. Das ist einfacher als die Art und Weise, wie ein echter Computer Video ausgeben würde, aber für den Moment reicht es.

source: So, the instruction <tt>STA $0200</tt> stores the value of the <tt>A</tt> register to memory location <tt>$0200</tt>. Click <b>Step</b> four more times to execute the rest of the instructions, keeping an eye on the <tt>A</tt> register as it changes.
de: Die Anweisung <tt>STA $0200</tt> speichert also den Wert des <tt>A</tt>-Registers an der Speicheradresse <tt>$0200</tt>. Klicke noch vier Mal auf <b>Schritt</b>, um die restlichen Anweisungen auszuführen, und beobachte dabei, wie sich das <tt>A</tt>-Register verändert.

source: Exercises
de: Übungen

source: Try changing the colour of the three pixels.
de: Versuche die Farbe der drei Pixel zu ändern.

source: Change one of the pixels to draw at the bottom-right corner (memory location <tt>$05ff</tt>).
de: Ändere eines der Pixel so, dass es in der unteren rechten Ecke gezeichnet wird (Speicheradresse <tt>$05ff</tt>).

source: Add more instructions to draw extra pixels.
de: Füge weitere Anweisungen hinzu, um zusätzliche Pixel zu zeichnen.

source: Registers and flags
de: Register und Flags

source: We've already had a little look at the processor status section (the bit with <tt>A</tt>, <tt>PC</tt> etc.), but what does it all mean?
de: Wir haben bereits einen kurzen Blick auf den Prozessorstatus-Bereich geworfen (den Teil mit <tt>A</tt>, <tt>PC</tt> usw.), aber was bedeutet das alles?

source: The first line shows the <tt>A</tt>, <tt>X</tt> and <tt>Y</tt> registers (<tt>A</tt> is often called the "accumulator"). Each register holds a single byte. Most operations work on the contents of these registers.
de: Die erste Zeile zeigt die Register <tt>A</tt>, <tt>X</tt> und <tt>Y</tt> (<tt>A</tt> wird oft als "Akkumulator" bezeichnet). Jedes Register enthält ein einzelnes Byte. Die meisten Operationen arbeiten mit dem Inhalt dieser Register.

source: <tt>SP</tt> is the stack pointer. I won't get into the stack yet, but basically this register is decremented every time a byte is pushed onto the stack, and incremented when a byte is popped off the stack.
de: <tt>SP</tt> ist der Stack-Pointer. Ich werde jetzt noch nicht auf den Stack eingehen, aber im Grunde wird dieses Register jedes Mal dekrementiert, wenn ein Byte auf den Stack geschoben wird, und inkrementiert, wenn ein Byte vom Stack genommen wird.

source: <tt>PC</tt> is the program counter - it's how the processor knows at what point in the program it currently is. It's like the current line number of an executing script. In the JavaScript simulator the code is assembled starting at memory location <tt>$0600</tt>, so <tt>PC</tt> always starts there.
de: <tt>PC</tt> ist der Programmzähler (program counter) - damit weiß der Prozessor, an welcher Stelle im Programm er sich gerade befindet. Es ist wie die aktuelle Zeilennummer eines ausgeführten Skripts. Im JavaScript-Simulator wird der Code ab der Speicheradresse <tt>$0600</tt> assembliert, daher beginnt <tt>PC</tt> immer dort.

source: The last section shows the processor flags. Each flag is one bit, so all seven flags live in a single byte. The flags are set by the processor to give information about the previous instruction. More on that later. <a href="https://web.archive.org/web/20210626024532/http://www.obelisk.me.uk/6502/registers.html">Read more about the registers and flags here</a>.
de: Der letzte Abschnitt zeigt die Prozessor-Flags. Jedes Flag ist ein Bit, sodass alle sieben Flags in einem einzigen Byte untergebracht sind. Die Flags werden vom Prozessor gesetzt, um Informationen über die vorherige Anweisung zu geben. Mehr dazu später. <a href="https://web.archive.org/web/20210626024532/http://www.obelisk.me.uk/6502/registers.html">Lies hier mehr über Register und Flags</a>.

source: Instructions
de: Anweisungen

source: Instructions in assembly language are like a small set of predefined functions. All instructions take zero or one arguments. Here's some annotated source code to introduce a few different instructions:
de: Anweisungen in der Assemblersprache sind wie eine kleine Sammlung vordefinierter Funktionen. Alle Anweisungen nehmen null oder ein Argument. Hier ist etwas kommentierter Quellcode, um einige verschiedene Anweisungen vorzustellen:

source: Assemble the code, then turn on the debugger and step through the code, watching the <tt>A</tt> and <tt>X</tt> registers. Something slightly odd happens on the line <tt>ADC #$c4</tt>. You might expect that adding <tt>$c4</tt> to <tt>$c0</tt> would give <tt>$184</tt>, but this processor gives the result as <tt>$84</tt>. What's up with that?
de: Assembliere den Code, schalte dann den Debugger ein und gehe den Code schrittweise durch, während du die Register <tt>A</tt> und <tt>X</tt> beobachtest. Etwas Seltsames passiert in der Zeile <tt>ADC #$c4</tt>. Du könntest erwarten, dass das Addieren von <tt>$c4</tt> zu <tt>$c0</tt> <tt>$184</tt> ergibt, aber dieser Prozessor gibt das Ergebnis als <tt>$84</tt> aus. Was hat es damit auf sich?

source: The problem is, <tt>$184</tt> is too big to fit in a single byte (the max is <tt>$FF</tt>), and the registers can only hold a single byte. It's OK though; the processor isn't actually dumb. If you were looking carefully enough, you'll have noticed that the carry flag was set to <tt>1</tt> after this operation. So that's how you know.
de: Das Problem ist, dass <tt>$184</tt> zu groß ist, um in ein einzelnes Byte zu passen (das Maximum ist <tt>$FF</tt>), und die Register können nur ein einzelnes Byte speichern. Aber keine Sorge; der Prozessor ist nicht wirklich dumm. Wenn du genau aufgepasst hast, wirst du bemerkt haben, dass das Carry-Flag nach dieser Operation auf <tt>1</tt> gesetzt wurde. So weißt du Bescheid.

source: In the simulator below <b>type</b> (don't paste) the following code:
de: Tippe (nicht einfügen) den folgenden Code in den Simulator ein:

source: An important thing to notice here is the distinction between <tt>ADC #$01</tt> and <tt>ADC $01</tt>. The first one adds the value <tt>$01</tt> to the <tt>A</tt> register, but the second adds the value stored at memory location <tt>$01</tt> to the <tt>A</tt> register.
de: Ein wichtiger Punkt hier ist der Unterschied zwischen <tt>ADC #$01</tt> und <tt>ADC $01</tt>. Der erste Befehl addiert den Wert <tt>$01</tt> zum <tt>A</tt>-Register, aber der zweite addiert den an der Speicheradresse <tt>$01</tt> gespeicherten Wert zum <tt>A</tt>-Register.

source: Assemble the code and select <b>Step</b> from the Run button's dropdown menu to step through these three instructions. The monitor in the debugger shows a section of memory, and can be helpful to visualise the execution of programs. <tt>STA $01</tt> stores the value of the <tt>A</tt> register at memory location <tt>$01</tt>, and <tt>ADC $01</tt> adds the value stored at the memory location <tt>$01</tt> to the <tt>A</tt> register. <tt>$80 + $80</tt> should equal <tt>$100</tt>, but because this is bigger than a byte, the <tt>A</tt> register is set to <tt>$00</tt> and the carry flag is set. As well as this though, the zero flag is set. The zero flag is set by all instructions where the result is zero.
de: Assembliere den Code und wähle <b>Schritt</b> aus dem Dropdown-Menü des Run-Buttons, um diese drei Anweisungen schrittweise durchzugehen. Der Monitor im Debugger zeigt einen Speicherbereich an und kann hilfreich sein, um die Ausführung von Programmen zu visualisieren. <tt>STA $01</tt> speichert den Wert des <tt>A</tt>-Registers an der Speicheradresse <tt>$01</tt>, und <tt>ADC $01</tt> addiert den an der Speicheradresse <tt>$01</tt> gespeicherten Wert zum <tt>A</tt>-Register. <tt>$80 + $80</tt> sollte <tt>$100</tt> ergeben, aber da dies größer als ein Byte ist, wird das <tt>A</tt>-Register auf <tt>$00</tt> gesetzt und das Carry-Flag wird gesetzt. Zusätzlich wird auch das Zero-Flag gesetzt. Das Zero-Flag wird bei allen Anweisungen gesetzt, bei denen das Ergebnis null ist.

source: A full list of the 6502 instruction set is <a href="http://www.6502.org/tutorials/6502opcodes.html">available here</a> and <a href="http://www.obelisk.me.uk/6502/reference.html">here</a> (I usually refer to both pages as they have their strengths and weaknesses). These pages detail the arguments to each instruction, which registers they use, and which flags they set. They are your bible.
de: Eine vollständige Liste des 6502-Befehlssatzes ist <a href="http://www.6502.org/tutorials/6502opcodes.html">hier</a> und <a href="http://www.obelisk.me.uk/6502/reference.html">hier</a> verfügbar (ich verweise normalerweise auf beide Seiten, da sie ihre Stärken und Schwächen haben). Diese Seiten beschreiben die Argumente für jede Anweisung, welche Register sie verwenden und welche Flags sie setzen. Sie sind deine Bibel.

source: You've seen <tt>TAX</tt>. You can probably guess what <tt>TAY</tt>, <tt>TXA</tt> and <tt>TYA</tt> do, but write some code to test your assumptions.
de: Du hast <tt>TAX</tt> gesehen. Du kannst wahrscheinlich erraten, was <tt>TAY</tt>, <tt>TXA</tt> und <tt>TYA</tt> tun, aber schreibe etwas Code, um deine Vermutungen zu testen.

source: Rewrite the first example in this section to use the <tt>Y</tt> register instead of the <tt>X</tt> register.
de: Schreibe das erste Beispiel in diesem Abschnitt so um, dass es das <tt>Y</tt>-Register anstelle des <tt>X</tt>-Registers verwendet.

source: The opposite of <tt>ADC</tt> is <tt>SBC</tt> (subtract with carry). Write a program that uses this instruction.
de: Das Gegenteil von <tt>ADC</tt> ist <tt>SBC</tt> (subtract with carry). Schreibe ein Programm, das diese Anweisung verwendet.

source: Branching
de: Verzweigungen

source: So far we're only able to write basic programs without any branching logic. Let's change that.
de: Bisher können wir nur einfache Programme ohne Verzweigungslogik schreiben. Lass uns das ändern.

source: 6502 assembly language has a bunch of branching instructions, all of which branch based on whether certain flags are set or not. In this example we'll be looking at <tt>BNE</tt>: "Branch on not equal".
de: Die 6502-Assemblersprache hat eine Reihe von Verzweigungsanweisungen, die alle basierend darauf verzweigen, ob bestimmte Flags gesetzt sind oder nicht. In diesem Beispiel schauen wir uns <tt>BNE</tt> an: "Branch on not equal" (Verzweige bei Ungleichheit).

source: First we load the value <tt>$08</tt> into the <tt>X</tt> register. The next line is a label. Labels just mark certain points in a program so we can return to them later. After the label we decrement <tt>X</tt>, store it to <tt>$0200</tt> (the top-left pixel), and then compare it to the value <tt>$03</tt>. <a href="http://www.obelisk.me.uk/6502/reference.html#CPX"><tt>CPX</tt></a> compares the value in the <tt>X</tt> register with another value. If the two values are equal, the <tt>Z</tt> flag is set to <tt>1</tt>, otherwise it is set to <tt>0</tt>.
de: Zuerst laden wir den Wert <tt>$08</tt> in das <tt>X</tt>-Register. Die nächste Zeile ist ein Label. Labels markieren bestimmte Stellen in einem Programm, damit wir später dorthin zurückkehren können. Nach dem Label dekrementieren wir <tt>X</tt>, speichern es in <tt>$0200</tt> (das Pixel oben links) und vergleichen es dann mit dem Wert <tt>$03</tt>. <a href="http://www.obelisk.me.uk/6502/reference.html#CPX"><tt>CPX</tt></a> vergleicht den Wert im <tt>X</tt>-Register mit einem anderen Wert. Wenn die beiden Werte gleich sind, wird das <tt>Z</tt>-Flag auf <tt>1</tt> gesetzt, andernfalls auf <tt>0</tt>.

source: The next line, <tt>BNE decrement</tt>, will shift execution to the decrement label if the <tt>Z</tt> flag is set to <tt>0</tt> (meaning that the two values in the <tt>CPX</tt> comparison were not equal), otherwise it does nothing and we store <tt>X</tt> to <tt>$0201</tt>, then finish the program.
de: Die nächste Zeile, <tt>BNE decrement</tt>, wird die Ausführung zum decrement-Label verschieben, wenn das <tt>Z</tt>-Flag auf <tt>0</tt> gesetzt ist (was bedeutet, dass die beiden Werte im <tt>CPX</tt>-Vergleich nicht gleich waren), andernfalls passiert nichts und wir speichern <tt>X</tt> in <tt>$0201</tt> und beenden dann das Programm.

source: In assembly language, you'll usually use labels with branch instructions. When assembled though, this label is converted to a single-byte relative offset (a number of bytes to go backwards or forwards from the next instruction) so branch instructions can only go forward and back around 256 bytes. This means they can only be used to move around local code. For moving further you'll need to use the jumping instructions.
de: In der Assemblersprache verwendet man normalerweise Labels mit Verzweigungsanweisungen. Beim Assemblieren wird dieses Label jedoch in einen einbytigen relativen Offset umgewandelt (eine Anzahl von Bytes, die von der nächsten Anweisung aus vor- oder rückwärts gegangen werden soll), sodass Verzweigungsanweisungen nur etwa 256 Bytes vor und zurück gehen können. Das bedeutet, dass sie nur für Bewegungen innerhalb von lokalem Code verwendet werden können. Für weitere Bewegungen musst du die Sprunganweisungen verwenden.

source: The opposite of <tt>BNE</tt> is <tt>BEQ</tt>. Try writing a program that uses <tt>BEQ</tt>.
de: Das Gegenteil von <tt>BNE</tt> ist <tt>BEQ</tt>. Versuche ein Programm zu schreiben, das <tt>BEQ</tt> verwendet.

source: <tt>BCC</tt> and <tt>BCS</tt> ("branch on carry clear" and "branch on carry set") are used to branch on the carry flag. Write a program that uses one of these two.
de: <tt>BCC</tt> und <tt>BCS</tt> ("branch on carry clear" und "branch on carry set") werden verwendet, um abhängig vom Carry-Flag zu verzweigen. Schreibe ein Programm, das eine dieser beiden Anweisungen verwendet.

source: Addressing modes
de: Adressierungsmodi

source: The 6502 uses a 16-bit address bus, meaning that there are 65536 bytes of memory available to the processor. Remember that a byte is represented by two hex characters, so the memory locations are generally represented as <tt>$0000 - $ffff</tt>. There are various ways to refer to these memory locations, as detailed below.
de: Der 6502 verwendet einen 16-Bit-Adressbus, was bedeutet, dass dem Prozessor 65536 Bytes Speicher zur Verfügung stehen. Denk daran, dass ein Byte durch zwei Hex-Zeichen dargestellt wird, sodass die Speicheradressen im Allgemeinen als <tt>$0000 - $ffff</tt> dargestellt werden. Es gibt verschiedene Möglichkeiten, sich auf diese Speicheradressen zu beziehen, wie unten beschrieben.

source: With all these examples you might find it helpful to use the memory monitor in the debugger to watch the memory change. The monitor takes a starting memory location and a number of bytes to display from that location. Both of these are hex values. For example, to display 16 bytes of memory from <tt>$c000</tt>, enter <tt>c000</tt> and <tt>10</tt> into <b>Start</b> and <b>Length</b>, respectively.
de: Bei all diesen Beispielen kann es hilfreich sein, den Speicher-Monitor im Debugger zu verwenden, um die Änderungen im Speicher zu beobachten. Der Monitor benötigt eine Startadresse und die Anzahl der Bytes, die von dieser Position angezeigt werden sollen. Beide Werte sind Hexadezimalzahlen. Um zum Beispiel 16 Bytes Speicher ab <tt>$c000</tt> anzuzeigen, gib <tt>c000</tt> und <tt>10</tt> in die Felder <b>Start</b> bzw. <b>Länge</b> ein.

source: Absolute: <tt>$c000</tt>
de: Absolut: <tt>$c000</tt>

source: With absolute addressing, the full memory location is used as the argument to the instruction. For example:
de: Bei der absoluten Adressierung wird die vollständige Speicheradresse als Argument für die Anweisung verwendet. Zum Beispiel:

source: Zero page: <tt>$c0</tt>
de: Nullseite: <tt>$c0</tt>

source: All instructions that support absolute addressing (with the exception of the jump instructions) also have the option to take a single-byte address. This type of addressing is called "zero page" - only the first page (the first 256 bytes) of memory is accessible. This is faster, as only one byte needs to be looked up, and takes up less space in the assembled code as well.
de: Alle Anweisungen, die absolute Adressierung unterstützen (mit Ausnahme der Sprunganweisungen), haben auch die Möglichkeit, eine einbyte-Adresse zu verwenden. Diese Art der Adressierung wird "Nullseite" genannt - nur die erste Seite (die ersten 256 Bytes) des Speichers ist zugänglich. Dies ist schneller, da nur ein Byte nachgeschlagen werden muss, und nimmt auch weniger Platz im assemblierten Code ein.

source: Zero page,X: <tt>$c0,X</tt>
de: Nullseite,X: <tt>$c0,X</tt>

source: This is where addressing gets interesting. In this mode, a zero page address is given, and then the value of the <tt>X</tt> register is added. Here is an example:
de: Hier wird die Adressierung interessant. In diesem Modus wird eine Nullseiten-Adresse angegeben und dann der Wert des <tt>X</tt>-Registers hinzuaddiert. Hier ist ein Beispiel:

source: If the result of the addition is larger than a single byte, the address wraps around. For example:
de: Wenn das Ergebnis der Addition größer als ein einzelnes Byte ist, wird die Adresse umgebrochen. Zum Beispiel:

source: Zero page,Y: <tt>$c0,Y</tt>
de: Nullseite,Y: <tt>$c0,Y</tt>

source: This is the equivalent of zero page,X, but can only be used with <tt>LDX</tt> and <tt>STX</tt>.
de: Dies ist das Äquivalent zu Nullseite,X, kann aber nur mit <tt>LDX</tt> und <tt>STX</tt> verwendet werden.

source: Absolute,X and absolute,Y: <tt>$c000,X</tt> and <tt>$c000,Y</tt>
de: Absolut,X und absolut,Y: <tt>$c000,X</tt> und <tt>$c000,Y</tt>

source: These are the absolute addressing versions of zero page,X and zero page,Y. For example:
de: Dies sind die absoluten Adressierungsversionen von Nullseite,X und Nullseite,Y. Zum Beispiel:

source: Unlike zero page,Y, absolute,Y can't be used with <tt>STX</tt> but can be used with <tt>LDA</tt> and <tt>STA</tt>.
de: Im Gegensatz zu Nullseite,Y kann absolut,Y nicht mit <tt>STX</tt> verwendet werden, aber mit <tt>LDA</tt> und <tt>STA</tt>.

source: Immediate: <tt>#$c0</tt>
de: Unmittelbar: <tt>#$c0</tt>

source: Immediate addressing doesn't strictly deal with memory addresses - this is the mode where actual values are used. For example, <tt>LDX #$01</tt> loads the value <tt>$01</tt> into the <tt>X</tt> register. This is very different to the zero page instruction <tt>LDX $01</tt> which loads the value at memory location <tt>$01</tt> into the <tt>X</tt> register.
de: Die unmittelbare Adressierung beschäftigt sich nicht direkt mit Speicheradressen - dies ist der Modus, in dem tatsächliche Werte verwendet werden. Zum Beispiel lädt <tt>LDX #$01</tt> den Wert <tt>$01</tt> in das <tt>X</tt>-Register. Dies unterscheidet sich deutlich von der Nullseiten-Anweisung <tt>LDX $01</tt>, die den Wert an der Speicheradresse <tt>$01</tt> in das <tt>X</tt>-Register lädt.

source: Relative: <tt>$c0</tt> (or label)
de: Relativ: <tt>$c0</tt> (oder Label)

source: Relative addressing is used for branching instructions. These instructions take a single byte, which is used as an offset from the following instruction.
de: Relative Adressierung wird für Verzweigungsanweisungen verwendet. Diese Anweisungen nehmen ein einzelnes Byte, das als Offset von der folgenden Anweisung verwendet wird.

source: Assemble the following code, then check the debugger to see the hexdump of the assembled code.
de: Assembliere den folgenden Code und schaue dann im Debugger, um den Hexdump des assemblierten Codes zu sehen.

source: The hex should look something like this:
de: Der Hexadezimalcode sollte etwa so aussehen:
